print()
print("---------------Функции и Методы---------------")
s1 = "Пропаганда"
s2 = "Сенсация"
s3 = "Сенсация * Сенсация * Сенсация * Сенсация"
s4 = "ОхОхОхАх"
print('s1 =', s1)
print('s2 =', s2)
print('s3 =', s3)
print('s4 =', s4)
print('s1 + s2 =', s1 + s2) # сложение двух строк
print('s1 * 3 =', s1 * 3) # умножение строки на 3, т.е. строка выведется 3 раза
print('s1[2] =', s1[2]) # вывод элемента строки s1 с индексом 2
print('s1[2,4] =', s1[2:4]) # извлечение среза строки s1 начинается с индекса 2 и заканчивается индексом 4
print('s3.count = ', s3.count(s2)) # кол-во вхождений подстроки s2 в s3 в результате выведется число
print('s1.find(''а'') =', s1.find('а')) # поиск подстроки 'а' в строке s1 результатом будет номер первого вхождения
print('s1.index(''п'') =', s1.index('п')) # поиск подстроки 'п' в строке s1 результатом будет номер первого вхождения
print('s1.rindex(''д'') =', s1.rindex('а')) # поиск подстроки 'а' в строке s1 результатом будет номер последнего вхождения
print('s4.replace(''Ох'' , ''Ах'', 2) =', s4.replace('Ох', 'Ах', 2)) # Замена шаблона. Строка 'Ох' - это шаблон, строка 'Ах' - это замена
print('s3.split(''*'') =', s3.split('*')) # разбиение по разделителю
print('s1.upper =', s1.upper()) # перевод символов в верхний регистр
print('s1.lower() =', s1.lower()) # перевод в нижний регистр

print()
print("---------------ВАРИАНТ_0---------------")
# s = input("Введите строку: \n")
s = "а роза упала на лапу азора"
flag = 1
string = ''
# Удаляем пробелы
for i in range(len(s)):
    if s[i] != ' ':
        string += s[i]
print("а роза упала на лапу азора")
print(string)
# Проверяем на палиндром
for i in range(len(s) // 2):
    if string[i] != string[-i - 1]:
        flag = 0
        break
if flag:
    print('Палиндром')
else:
    print('не Палиндром')

print()
print("---------------ВАРИАНТ_1---------------")
# n = input("Введите строку: \n")
n1 = "ездОк, поехать, Три, еВро, свич, Ермолино"
k1 = 0
for i in n1.split():
    if i.lower().startswith('е'): # учитываем регистр
        k1 += 1
print("Переменная: ", n1)
print("Кол-во замен: ", k1)

print()
print("---------------ВАРИАНТ_2---------------")
# n2 = input("Введите строку: \n")
n2 = "Выполнение программы: Выполнено 101: -> должен быть процент!!! "
zamena = n2.replace(':', '%')
k2 = 0
for i in zamena.split():
    if i.count('%'):
        k2 += 1
print("Было ->", n2)
print("Стало ->", zamena)
print("Кол-во замен: ", k2)


print()
print("---------------ВАРИАНТ_3---------------")
# n3 = input("Введите строку: \n")
n3 = "Строки с точкой заменяются на пробел: ->.<- , ->.<-, ->.<- "
zamena = n3.replace('.', ' ')
k3 = 0
for i in n3.split():
    if i.count('.'):
        k3 += 1
print(n3)
print("Переменная ->", zamena)
print("Кол-во замен: ", k3)

print()
print("---------------ВАРИАНТ_4---------------")
# n4 = input("Введите строку: \n")
n4 = 'анаконда'
count_n4 = n4.count('а')
replace_n4 = n4.replace('а', 'о')
len_n4 = len(n4)

print("Было ->", n4)
print("Стало ->", replace_n4)
print("Кол-во замен: ", count_n4)
print("Всего символов: ", len_n4)

print()
print("---------------ВАРИАНТ_5---------------")
# n5 = input("Введите CAPS'ом: \n")
n5 = "VSUET"
lower_n5 = n5.lower()
print(lower_n5)

print()
print("---------------ВАРИАНТ_6---------------")
# n6 = input("Введите строку: \n")
n6 = "ананас"
count_n6 = n6.count("а")
new_n6 = n6.replace("а", "")
print("Новый текст ->", new_n6)
print("Кол-во замен: ", count_n6)

print()
print("---------------ВАРИАНТ_7---------------")
# txt7 = input("Введите строку: \n")
txt7 = "папапапа"
n = len(txt7) // 2

# Делим текст на половину и меняем 'п' на '*'
first = txt7[:n].replace("п", "*")

# Оставляем вторую половину без изменений
second = txt7[n:]
fin = first + second
print(fin)

print()
print("---------------ВАРИАНТ_8---------------")
# n8 = input("Введите строку: \n")
n8 = "Дана строчка с точкой."
split_n8 = n8.split()
count_n8 = len(split_n8)

print("Кол-во слов в строке ->", count_n8)

print()
print("---------------ВАРИАНТ_9---------------")
# n9 = input("Введите строку: \n")
n9 = "данное слово слово слово встречается столько раз:"
txt = "слово"
splitxt = n9.split()
count_n9 = splitxt.count(txt)

print("Заданное слово ->", txt)
print("Встречается всего: ", count_n9, "раз(а)")

print()
print("---------------ВАРИАНТ10---------------")
# n10 = input("Введите строку: \n")
n10 = "wish i never met you"
txt = n10.title()
print(txt)

print()
print("---------------ВАРИАНТ11---------------")
# n11 = input("Введите строку: \n")
n11 = "анннн! аннн! нпппннннпппп!"
max_n = 0
k11 = 0

for i in range(len(n11)):
    if n11[i] == 'н':
        k11 += 1
        if k11 > max_n:
            max_n = k11
    else:
        k11 = 0

res = n11.replace("!", ".")
print("Строчка с (!) ->", n11)
print("Строчка с (.) ->", res)
print("Самая длинная строчка: ", max_n)

print()
print("---------------ВАРИАНТ12---------------")
# n12 = input("Введите строку: \n")
n12 = "Последняя строчка является окончательной"
split_n12 = n12.split()
res = []
for i in split_n12:
    if i.endswith('я'):
        res.append(i)
print(res)

print()
print("---------------ВАРИАНТ13---------------")
# n13 = input("Введите строку: \n")
n13 = "Текст (внутри скобок), а тут продолжение"
start = n13.find("(")
end = n13.find(")")
if start != -1 and end != -1:
    res = n13[start + 1:end]
    print(res)

print()
print("---------------ВАРИАНТ14---------------")
# n14 = input("Введите строку: \n")
n14 = "яблоко апупуня пупуння шампупуня адресовая"
split_n14 = n14.split()
res = []
for i in split_n14:
    if i.startswith("а"):
        if i.endswith("я"):
            res.append(i)
print(res)

print()
print("---------------ВАРИАНТ15---------------")
# n15 = input("Введите строку: \n")
n15 = "татары тарасы т34 ттттт"
count= n15.count("т")
print("Текст ->", n15)
print("Кол-во букв т:", count)